app/views/home/simple_index.html.erb


                    <% if time_period[:medications].any? %>
---
SELECT "medications".* FROM "medications"
SELECT 1 AS one FROM "medications" LIMIT ?  [["LIMIT", 1]]