app/controllers/home_controller.rb

SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" IN (?, ?, ?, ?, ?, ?)  [["pillbox_id", 1], ["pillbox_id", 3], ["pillbox_id", 2], ["pillbox_id", 4], ["pillbox_id", 5], ["pillbox_id", 6]]
SELECT "medications".* FROM "medications" WHERE "medications"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "pillboxes".* FROM "pillboxes" WHERE "pillboxes"."user_id" = ?  [["user_id", 2]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = ?  [["user_id", 1]]
---
  def index
    # Get current user's data only
    @medications = current_user.medications.where(active: true)
    @schedules = current_user.schedules
    @pillboxes = current_user.pillboxes.includes(:compartments)

SELECT COUNT(*) FROM "medications"
SELECT COUNT(*) FROM "schedules"
SELECT COUNT(*) FROM "medication_logs"
---
  def test
    @medications = current_user.medications rescue []
    @schedules = current_user.schedules rescue []
    @today_logs = current_user.medication_logs rescue []

    render plain: "Database Test Results:

Medications: #{@medications.count} found
Schedules: #{@schedules.count} found
Logs: #{@today_logs.count} found

SELECT "medications".* FROM "medications" ORDER BY "medications"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "medications"
SELECT COUNT(*) FROM "schedules"
---
  def check_database_status
    return "Connected - #{Medication.count} medications, #{Schedule.count} schedules"

SELECT "schedules".* FROM "schedules"
SELECT "schedule_medications".* FROM "schedule_medications" WHERE "schedule_medications"."schedule_id" = ?  [["schedule_id", 2]]
---
          <div class="card">
            <h2>Today's Schedule</h2>
            #{schedules.any? ? schedules.map { |schedule|
              schedule_meds = schedule.schedule_medications.map { |sm|

SELECT COUNT(*) FROM "compartments" WHERE "compartments"."pillbox_id" = ?  [["pillbox_id", 15]]
---
                      #{refill_badge}
                    </div>
                    <p style=\"margin: 4px 0; color: #6b7280; font-size: 14px;\">
                      <strong>#{pillbox.compartments.count}</strong> compartments • <strong>#{pillbox.total_medications}</strong> medications