app/controllers/medications_controller.rb

SELECT "medication_logs".* FROM "medication_logs" WHERE "medication_logs"."medication_id" IN (?, ?)  [["medication_id", 8], ["medication_id", 7]]
SELECT "medications".* FROM "medications" WHERE "medications"."user_id" = ? AND "medications"."active" = ?  [["user_id", 4], ["active", 1]]
---
  def index
    @medications = current_user.medications.where(active: true).includes(:schedules, :medication_logs)

INSERT INTO "medications" ("name", "dosage", "frequency", "instructions", "active", "color", "shape", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @medication = current_user.medications.build(medication_params)

    if @medication.save

UPDATE "medications" SET "active" = ?, "updated_at" = ? WHERE "medications"."id" = ?  [["active", 0], ["updated_at", "2025-10-14 01:30:06.530326"], ["id", 12]]
---
  def destroy
    name = @medication.name
    @medication.update(active: false)

SELECT "medications".* FROM "medications" WHERE "medications"."user_id" = ? AND "medications"."id" = ? LIMIT ?  [["user_id", 4], ["id", 12], ["LIMIT", 1]]
---
  def set_medication
    @medication = current_user.medications.find(params[:id])