app/controllers/pillboxes_controller.rb

SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" IN (?, ?)  [["pillbox_id", 13], ["pillbox_id", 12]]
SELECT "pillboxes".* FROM "pillboxes" WHERE "pillboxes"."user_id" = ?  [["user_id", 2]]
---
  def index
    @pillboxes = current_user.pillboxes.includes(:compartments)

SELECT "compartment_medications".* FROM "compartment_medications" WHERE "compartment_medications"."compartment_id" IN (?, ?, ?, ?, ?, ?, ?)  [["compartment_id", 69], ["compartment_id", 70], ["compartment_id", 71], ["compartment_id", 72], ["compartment_id", 73], ["compartment_id", 74], ["compartment_id", 75]]
SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" = ? ORDER BY "compartments"."position" ASC  [["pillbox_id", 8]]
SELECT "medications".* FROM "medications" WHERE "medications"."id" IN (?, ?, ?)  [["id", 15], ["id", 16], ["id", 13]]
---
  def show
    @compartments = @pillbox.compartments.by_position.includes(:compartment_medications, :medications)

SELECT "medications".* FROM "medications" WHERE "medications"."user_id" = ? AND "medications"."active" = ?  [["user_id", 2], ["active", 1]]
---
  def wizard
    @pillbox = current_user.pillboxes.build
    @medications = current_user.medications.where(active: true)

INSERT INTO "pillboxes" ("schedule_id", "name", "pillbox_type", "week_starting", "created_at", "updated_at", "user_id", "last_filled_at", "notes") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" = ?  [["pillbox_id", 8]]
INSERT INTO "compartments" ("pillbox_id", "name", "position", "day_of_week", "time_of_day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["pillbox_id", 8], ["name", "Monday"], ["position", 1], ["day_of_week", "monday"], ["time_of_day", nil], ["created_at", "2025-12-12 01:57:52.044623"], ["updated_at", "2025-12-12 01:57:52.044623"]]
SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" = ? AND "compartments"."name" = ? LIMIT ?  [["pillbox_id", 9], ["name", "1"], ["LIMIT", 1]]
---
  def wizard_create
    pillbox_data = parse_wizard_data(params)

    # Validate required fields
    errors = []
    errors << "Pill box name is required" if pillbox_data[:name].blank?
    errors << "Pill box type is required" if pillbox_data[:type].blank?

    # Validate compartments for daily pill boxes
    if pillbox_data[:type] == 'daily'
      if pillbox_data[:compartments].empty?
        errors << "Daily pill boxes need at least one compartment"
      elsif pillbox_data[:compartments].count { |c| c.present? } > Pillbox::MAX_DAILY_COMPARTMENTS
        errors << "Daily pill boxes can have a maximum of #{Pillbox::MAX_DAILY_COMPARTMENTS} compartments"
      end

      # Check for duplicate compartment names
      non_blank = pillbox_data[:compartments].reject(&:blank?).map(&:strip)
      duplicates = non_blank.select { |name| non_blank.count(name) > 1 }.uniq
      if duplicates.any?
        errors << "Compartment names must be unique. Duplicates found: #{duplicates.join(', ')}"
      end
    end

    # Validate name length
    if pillbox_data[:name].present? && pillbox_data[:name].length > 15
      errors << "Pill box name is too long (maximum 15 characters)"

SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" = ?  [["pillbox_id", 8]]
INSERT INTO "compartments" ("pillbox_id", "name", "position", "day_of_week", "time_of_day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["pillbox_id", 9], ["name", "1"], ["position", 1], ["day_of_week", nil], ["time_of_day", "1"], ["created_at", "2025-12-12 02:16:14.161634"], ["updated_at", "2025-12-12 02:16:14.161634"]]
---
    # Validate compartment name lengths for daily
    if pillbox_data[:type] == 'daily'
      long_compartments = pillbox_data[:compartments].reject(&:blank?).select { |name| name.strip.length > 10 }
      if long_compartments.any?
        errors << "Compartment names are too long (maximum 10 characters)"

INSERT INTO "pillboxes" ("schedule_id", "name", "pillbox_type", "week_starting", "created_at", "updated_at", "user_id", "last_filled_at", "notes") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      notes: pillbox_data[:notes]
    )

    if @pillbox.save

INSERT INTO "compartments" ("pillbox_id", "name", "position", "day_of_week", "time_of_day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["pillbox_id", 14], ["name", "daily1"], ["position", 1], ["day_of_week", nil], ["time_of_day", "daily1"], ["created_at", "2025-12-12 06:31:33.490832"], ["updated_at", "2025-12-12 06:31:33.490832"]]
---
        # For daily: use compartment names from form
        pillbox_data[:compartments].each_with_index do |comp_name, index|
          next if comp_name.blank?
          @pillbox.compartments.create!(
            name: comp_name.strip,
            position: index + 1,
            time_of_day: comp_name.strip.downcase.gsub(/\s+/, '_')
          )

SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" = ? AND "compartments"."name" = ? LIMIT ?  [["pillbox_id", 14], ["name", "daily1"], ["LIMIT", 1]]
SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" = ? AND "compartments"."day_of_week" = ? LIMIT ?  [["pillbox_id", 8], ["day_of_week", "monday"], ["LIMIT", 1]]
---
          # assignment_key could be compartment name or day of week
          # Find compartment by name for daily, by day_of_week for weekly
          compartment = if @pillbox.daily?
            @pillbox.compartments.find_by(name: assignment_key) ||
            @pillbox.compartments.offset(assignment_key.to_i).first
          else
            @pillbox.compartments.find_by(day_of_week: assignment_key)

SELECT "medications".* FROM "medications" WHERE "medications"."user_id" = ? AND "medications"."id" = ? LIMIT ?  [["user_id", 4], ["id", 15], ["LIMIT", 1]]
---
          # med_data is now a hash of med_id => quantity
          med_data.each do |med_id, quantity|
            next if med_id.blank? || quantity.blank? || quantity.to_i <= 0
            medication = current_user.medications.find_by(id: med_id)

INSERT INTO "pillboxes" ("schedule_id", "name", "pillbox_type", "week_starting", "created_at", "updated_at", "user_id", "last_filled_at", "notes") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @pillbox = current_user.pillboxes.build(pillbox_params)

    if @pillbox.save

SELECT "medications".* FROM "medications" WHERE "medications"."user_id" = ? AND "medications"."active" = ?  [["user_id", 4], ["active", 1]]
SELECT "medications".* FROM "medications" INNER JOIN "compartment_medications" ON "medications"."id" = "compartment_medications"."medication_id" WHERE "compartment_medications"."compartment_id" = ?  [["compartment_id", 101]]
SELECT "compartment_medications".* FROM "compartment_medications" WHERE "compartment_medications"."compartment_id" = ?  [["compartment_id", 76]]
SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" = ?  [["pillbox_id", 9]]
---
  def edit
    @medications = current_user.medications.where(active: true)
    @compartments = @pillbox.compartments.by_position.includes(:compartment_medications, :medications)

UPDATE "pillboxes" SET "updated_at" = ?, "last_filled_at" = ? WHERE "pillboxes"."id" = ?  [["updated_at", "2025-12-12 04:01:22.530893"], ["last_filled_at", "2025-12-12 04:01:22.515537"], ["id", 13]]
SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" = ? AND "compartments"."id" = ? LIMIT ?  [["pillbox_id", 14], ["id", 105], ["LIMIT", 1]]
DELETE FROM "compartments" WHERE "compartments"."id" = ?  [["id", 76]]
DELETE FROM "pillboxes" WHERE "pillboxes"."id" = ?  [["id", 9]]
DELETE FROM "compartment_medications" WHERE "compartment_medications"."id" = ?  [["id", 36]]
INSERT INTO "compartment_medications" ("compartment_id", "medication_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["compartment_id", 105], ["medication_id", 15], ["quantity", 1], ["created_at", "2025-12-12 06:36:35.298401"], ["updated_at", "2025-12-12 06:36:35.298401"]]
SELECT "compartment_medications".* FROM "compartment_medications" WHERE "compartment_medications"."compartment_id" = ?  [["compartment_id", 101]]
SELECT "medications".* FROM "medications" WHERE "medications"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def update
    if @pillbox.update(pillbox_params)
      # Update medication assignments
      if params[:medication_assignments].present?
        params[:medication_assignments].each do |comp_id, assignments|
          compartment = @pillbox.compartments.find_by(id: comp_id)
          next unless compartment

          # Clear existing assignments for this compartment
          compartment.compartment_medications.destroy_all

          # Add new assignments
          if assignments[:medications].present?
            assignments[:medications].each do |med_id, quantity_data|
              next if med_id.blank? || quantity_data[:quantity].to_i <= 0

              compartment.compartment_medications.create(
                medication_id: med_id,
                quantity: quantity_data[:quantity].to_i
              )
            end
          end
        end
      end

      redirect_to pillbox_path(@pillbox), notice: 'Pill box updated successfully!'
    else
      @medications = current_user.medications.where(active: true)
      @compartments = @pillbox.compartments.by_position.includes(:compartment_medications, :medications)

DELETE FROM "pillboxes" WHERE "pillboxes"."id" = ?  [["id", 9]]
---
  def destroy
    @pillbox.destroy

SELECT "compartments".* FROM "compartments" WHERE "compartments"."pillbox_id" = ? ORDER BY "compartments"."position" ASC  [["pillbox_id", 13]]
---
  def fill
    @compartments = @pillbox.compartments.order(:position)

UPDATE "pillboxes" SET "updated_at" = ?, "last_filled_at" = ? WHERE "pillboxes"."id" = ?  [["updated_at", "2025-12-17 21:54:21.655414"], ["last_filled_at", "2025-12-17 21:54:21.653565"], ["id", 15]]
---
  def mark_filled
    # Update last_filled_at timestamp
    @pillbox.update(last_filled_at: Time.current)

SELECT "pillboxes".* FROM "pillboxes" WHERE "pillboxes"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def set_pillbox
    @pillbox = Pillbox.find(params[:id])

SELECT "medications".* FROM "medications" INNER JOIN "compartment_medications" ON "medications"."id" = "compartment_medications"."medication_id" WHERE "compartment_medications"."compartment_id" = ?  [["compartment_id", 110]]
SELECT "compartment_medications".* FROM "compartment_medications" WHERE "compartment_medications"."compartment_id" = ? AND "compartment_medications"."medication_id" = ? LIMIT ?  [["compartment_id", 110], ["medication_id", 15], ["LIMIT", 1]]
---
  def render_fill_compartment(compartment, pillbox)
    medications = compartment.medications

    <<~HTML
      <div data-compartment="#{compartment.id}" style="background: #f9fafb; border: 2px solid #e5e7eb; border-radius: 8px; padding: 20px; transition: all 0.3s ease;">
        <div style="font-weight: 600; font-size: 18px; color: #1f2937; margin-bottom: 16px;">
          #{h(compartment.display_name)}
        </div>
        #{if medications.any?
          "<div style=\"display: grid; gap: 10px;\">
            #{medications.map { |med|
              quantity = compartment.compartment_medications.find_by(medication_id: med.id)&.quantity || 1

SELECT COUNT(*) FROM "compartments" WHERE "compartments"."pillbox_id" = ?  [["pillbox_id", 15]]
---
  def render_pillbox_card(pillbox)
    <<~HTML
      <div style="background: white; padding: 20px; border-radius: 12px; box-shadow: 0 2px 8px rgba(0,0,0,0.1); border-left: 4px solid #{pillbox.daily? ? '#3b82f6' : '#10b981'};">
        <div style="display: flex; justify-content: space-between; align-items: start; margin-bottom: 12px;">
          <div>
            <h3 style="margin: 0 0 8px 0; font-size: 20px; color: #1f2937;">#{pillbox.name}</h3>
            <div style="display: flex; gap: 12px; align-items: center; flex-wrap: wrap;">
              <span style="background: #{pillbox.daily? ? '#3b82f6' : '#10b981'}; color: white; padding: 4px 12px; border-radius: 12px; font-size: 12px; font-weight: 600;">
                #{pillbox.pillbox_type.capitalize}
              </span>
              <span style="color: #6b7280; font-size: 14px;">#{pillbox.compartments.count} compartments</span>

SELECT "compartment_medications".* FROM "compartment_medications" WHERE "compartment_medications"."compartment_id" = ?  [["compartment_id", 105]]
SELECT "medications".* FROM "medications" WHERE "medications"."id" IN (?, ?)  [["id", 15], ["id", 13]]
---
  def render_compartment_card(compartment, pillbox)
    meds = compartment.compartment_medications.includes(:medication)

SELECT "compartment_medications".* FROM "compartment_medications" WHERE "compartment_medications"."compartment_id" IN (?, ?, ?, ?, ?, ?)  [["compartment_id", 110], ["compartment_id", 111], ["compartment_id", 112], ["compartment_id", 113], ["compartment_id", 114], ["compartment_id", 115]]
SELECT "medications".* FROM "medications" WHERE "medications"."id" IN (?, ?, ?)  [["id", 15], ["id", 16], ["id", 13]]
SELECT COUNT(*) FROM "compartments" WHERE "compartments"."pillbox_id" = ?  [["pillbox_id", 15]]
SELECT "compartment_medications".* FROM "compartment_medications" WHERE "compartment_medications"."compartment_id" = ?  [["compartment_id", 110]]
SELECT "medications".* FROM "medications" WHERE "medications"."id" IN (?, ?)  [["id", 15], ["id", 16]]
SELECT "medications".* FROM "medications" WHERE "medications"."id" = ?  [["id", 15]]
---
  def render_visual_compartment(compartment)
    meds = compartment.compartment_medications.includes(:medication)
    total_pills = meds.sum(&:quantity)
    has_meds = meds.any?

    <<~HTML
      <div style="background: linear-gradient(135deg, #f3f4f6 0%, #e5e7eb 100%); padding: 16px; border-radius: 12px; border: 3px solid #{has_meds ? '#3b82f6' : '#d1d5db'}; min-height: 200px; display: flex; flex-direction: column; position: relative; box-shadow: 0 2px 4px rgba(0,0,0,0.1);">
        <div style="text-align: center; margin-bottom: 12px;">
          <div style="font-weight: 700; font-size: 14px; color: #1f2937; margin-bottom: 4px;">#{h(compartment.display_name)}</div>
          <div style="font-size: 11px; color: #6b7280;">Pos. #{compartment.position}</div>
        </div>

        <div style="flex: 1; display: flex; flex-direction: column; justify-content: center; gap: 8px; min-height: 120px;">
          #{if has_meds
            meds.map { |cm|
              pills_html = (1..cm.quantity).map { render_pill(cm.medication.color, cm.medication.shape) }.join('')

SELECT "compartment_medications".* FROM "compartment_medications" WHERE "compartment_medications"."compartment_id" = ?  [["compartment_id", 110]]
SELECT "medications".* FROM "medications" WHERE "medications"."id" IN (?, ?)  [["id", 15], ["id", 16]]
---
  def render_edit_compartment_section(compartment, medications)
    current_meds = compartment.compartment_medications.includes(:medication).index_by(&:medication_id)