app/controllers/sessions_controller.rb

  def create
    email = params[:email]&.downcase
    password = params[:password]

    user = User.authenticate(email, password)

    if user
      session[:user_id] = user.id
      user.update(last_login_at: Time.current)
---
UPDATE "users" SET "last_login_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_login_at", "2025-10-14 00:41:12.295375"], ["updated_at", "2025-10-14 00:41:12.298960"], ["id", 1]]