app/models/pillbox.rb

  def add_compartment(name:, time_of_day: nil)
    return false if daily? && compartments.count >= MAX_DAILY_COMPARTMENTS

    position = compartments.maximum(:position).to_i + 1
    compartments.create!(
      name: name,
      position: position,
      time_of_day: time_of_day
    )
---
INSERT INTO "compartments" ("pillbox_id", "name", "position", "day_of_week", "time_of_day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def create_default_compartments
    case pillbox_type
    when 'daily'
      # For daily pillboxes, don't auto-create compartments
      # Users will add them through the wizard (up to 12)
    when 'weekly'
      # Create 7 compartments, one for each day of the week
      DAYS_OF_WEEK.each_with_index do |day, index|
        compartments.create!(
          name: day.capitalize,
          position: index + 1,
          day_of_week: day
        )
---
INSERT INTO "compartments" ("pillbox_id", "name", "position", "day_of_week", "time_of_day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["pillbox_id", 4], ["name", "Monday"], ["position", 1], ["day_of_week", "monday"], ["time_of_day", nil], ["created_at", "2025-12-11 22:10:28.138011"], ["updated_at", "2025-12-11 22:10:28.138011"]]